# IsVisible Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisResultSchema..::..IsVisible Property
AnalysisResultSchema Class See Also
---
If true analysis result is visible in view
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsVisible { get; set; }
```

Visual Basic
---
```text
Public Property IsVisible As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsVisible {
	bool get ();
	void set (bool value);
}
```

# See Also
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace